Revit 2027 API
FabricationConfiguration.GetMaterialByGUID Method
 Gets the material identifier by its GUID.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetMaterialByGUID(
	Guid materialGUID
)
Public Function GetMaterialByGUID (
	materialGUID As Guid
) As Integer
public:
int GetMaterialByGUID(
	Guid materialGUID
)
member GetMaterialByGUID :
        materialGUID : Guid -> int
Parameters
materialGUID Guid
 The material GUID.
Return Value
Int32
 The material identifier. Returns 0 if not found.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace